'''
Домашнє завдання 8



Завантажте цей набір даних рейтингу кави та створіть візуалізації, щоб відповісти на запитання. 
Ви можете використовувати додаткові типи графіків до тих, які ми дізналися на уроках, якщо ви думаєте, що вони допоможуть відповісти на запитання.

Ви можете знайти опис набору даних тут.



1. Які країни є великими експортерами кави?

2. Які кореляції між різними показниками оцінки кави?

3. Який (якщо є) вплив кольору зерен на загальний сорт кави?

4. Чи впливає країна походження на якість кави?

5. Чи суттєво впливає висота на якість кави?







Рекомендації по виконанню:


Прочитаймо набір даних про каву.

https://raw.githubusercontent.com/rfordatascience/tidytuesday/master/data/2020/2020-07-07/coffee_ratings.csv

Спочатку перевіряється наявність файлу 'coffee_ratings.csv' в поточному каталозі. Якщо файл вже існує, програма просто продовжує виконання.
 У протилежному випадку відбувається завантаження файлу з вказаної URL-адреси.

Перевіряється наявність файлу 'coffee_ratings.csv' за допомогою функції os.path.exists().

Якщо файл не існує, виконується HTTP-запит за допомогою бібліотеки requests для отримання вмісту документа за URL-адресою.

Якщо статус відповіді є успішним, тобто

requests.get(' URL-адреса').status_code == 200

(код 200), отриманий вміст записується у файл з розширенням csv.

Завантажений файл зчитується у DataFrame за допомогою функції pandas.read_table().

2 завдання

Створює графіки для візуалізації даних:

1)   Вертикальна стовпчаста діаграма або горизонтальна стовпчаста діаграма для топ-10 країн з найбільшим обсягом експорту кави.

2)   або  Стовпчаста діаграма з градієнтними кольорами для кожної країни.

3)   або Кругова діаграма для топ-10 експортерів кави, відображаючи відсоткове співвідношення кожної країни у виробництві кави.

4)   або свій варіант

Графік має своє призначення та надає інформацію про топ-10 експортерів кави за кількістю експортованих мішків.
 Графік реалізований за допомогою бібліотек matplotlib або seaborn. 

3 завдання

Обчислимо матрицю кореляцій між різними показниками оцінки кави, використовуючи кореляцію Пірсона.

Візуалізуймо матрицю кореляцій за допомогою теплової карти (heatmap), що дозволяє швидко зрозуміти залежності між різними показниками оцінки кави.

Виділимо атрибути зі значенням кореляції більше або рівно 0,65, ігноруючи кореляції з "sweetness", "uniformity" та "clean_cup" – це моя рекомендація,
 у Вас може бути інше бачення.

Побудуймо матрицю кореляцій лише для відібраних атрибутів зі значеннями кореляції, більшими або рівними 0,65. 

4 завдання

Для кожного виду кави "species" і кольору зерен обчислені середні значення загальної оцінки (total_cup_points).
 Можна використати такі візуалізації для аналізу впливу кольору зерен на загальну оцінку:

1)   теплову карту (heatmap), яка дозволяє порівняти середні значення загальної оцінки для різних комбінацій виду кави і кольору зерен.

2)   або стовпчикову діаграму для порівняння середніх значень загальної оцінки для різних видів кави в залежності від кольору зерен. 
Ця візуалізація дозволяє легко порівняти вплив кольору зерен на різні види кави.

3)   або графік розсіювання (scatter plot), де кожна точка відповідає одному виду кави, а координати точки - середній рейтинг кави для кожного кольору зерен. 
Це дозволяє побачити загальну тенденцію для кожного виду кави та вплив кольору зерен на його рейтинг.

4)   або свій варіант

У візуалізації використаймо різні палітри кольорів для візуального розрізнення різних кольорів зерен.

5 завдання

Для аналізу впливу країни походження на якість кави використаймо дані про середню оцінку кави (total_cup_points) за країною походження 'country_of_origin'.
 За допомогою теплової карти або графіка розсіювання (або свій варіант) проаналізуймо залежність середньої оцінки від країни походження. 
 Додатково використаймо коефіцієнт кореляції Спірмена для оцінки статистичної зв'язку між країною походження та загальною оцінкою кави.

Можливі варіанти візуалізацій:

1)   стовпчикова діаграма, де кожна країна відображається з середніми балами якості кави;

2)   горизонтальна стовпчикова діаграма;

3)   точкова діаграма у різних видах (не дуже хороший, але можливий варіант);

4)   свій варіант.

6 завдання

 

Дані про висоту над рівнем моря та загальні бали кави аналізуються (мається на увазі на невідповідність, невідповідні, неможливі, 
неправильні значення висоти над рівнем моря виключаються з аналізу), а потім відображаються на графіку для візуального аналізу залежності між ними.

Використовується ядерна оцінка щільності для відображення розподілу оцінок кави залежно від висоти над рівнем моря. Рекомендую додати лінії, 
що позначають діапазон оцінок від 80 до 85, а також діапазон висоти над рівнем моря від 500 до 2000 метрів.

Можна також показати розподіл total_cup_points в залежності від висоти над рівнем моря за допомогою теплової карти.

Інші варіанти візуалізації використовують гексагональні біноми, розсіювання або гістограму для показу взаємозв'язку між висотою над рівнем моря 
та загальними балами кави.
'''