'''
У класі професора Грубла щойно був іспит. Він почав перевіряти роботи, але
оцінював їх не дуже уважно.
Напишіть програму, яка
приймає як вхідні дані оцінку кожного учня і те, чи здав він
іспит.
Потім програмі необхідно надрукувати дві речі:
a. Чи був професор Грубл послідовним у проставленні позначки
"Passed" для студентів.
b. Якщо професор Грубл був послідовним, виведіть діапазон у
якому знаходиться поріг для складання іспиту.
Приклади:
Припустимо, ми отримуємо такі дані, як вхідні дані:

У цьому випадку професор, на жаль, непослідовний, тому що
Student 6 має позначку “Passed” з оцінкою 75, а Student 1 має позначку
"Failed" при вищій оцінці - 78.

Тепер припустимо, що ми отримали такі значення:

#3 2

В цьому випадку професор послідовний, а поріг складання іспиту
знаходиться в
діапазоні 73 – 78 балів.
'''
def get_valid_input(prompt):
    while True:
        try:
            value = int(input(prompt))
            if value <= 0:
                raise ValueError("Введіть позитивне ціле число.")
            return value
        except ValueError as e:
            print(f"Error: {e}")
            continue  



